app/Controllers/StudentController.php

    public function save()
    {

        if ($this->request->isAJAX()) {

            $validate = [
                'name' => [
                    'rules' => 'required|min_length[3]|max_length[100]',
                ],
                'subject' => [
                    'rules' => 'required|min_length[3]|max_length[100]',
                ],
                'mark' => [
                    'rules' => 'required|integer'
                ]
            ];

            if (!$this->validate($validate)) {
                return response()->setJSON([
                    'token' => csrf_hash(),
                    'errors' => $this->validator->getErrors()
                ]);
            } else {

                $student = new Student();
                $exist = $student->asObject()->where(['name' => $this->request->getPost('name'), 'subject' => $this->request->getPost('subject')])->first();

                if ($exist) {

                    $student->where('id', $exist->id)->set(['mark' => $this->request->getPost('mark')])->update();
---
SELECT *
FROM `students`
WHERE `name` = 'jithin'
AND `subject` = 'maths'
 LIMIT 1
UPDATE `students` SET `mark` = '80'
WHERE `id` = '69'

                        'subject' => ucfirst($this->request->getPost('subject')),
                        'mark' => $this->request->getPost('mark')
                    ];
                    $student->insert($studentData);
---
INSERT INTO `students` (`name`, `subject`, `mark`) VALUES ('Jithin', 'Maths', '70')

    public function index()
    {
        $search = $this->request->getGet('search');
        $student = new Student();

        if(isset($search)){

            $data['students'] = $student->asObject()
            ->like('name', $search)
            ->orLike('subject', $search)
            ->orLike('mark', $search)
            ->orderBy('id', 'DESC')
            ->paginate(5);

        }else{

            $data['students'] = $student->asObject()
            ->orderBy('id', 'DESC')
            ->paginate(5);
---
SELECT *
FROM `students`
ORDER BY `id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `students`

    public function action()
    {

        if ($this->request->isAJAX()) {

            if ($this->request->getPost('action') == 'edit') {

                $validate = [
                    'name' => [
                        'rules' => 'required|min_length[3]|max_length[100]',
                    ],
                    'subject' => [
                        'rules' => 'required|min_length[3]|max_length[100]',
                    ],
                    'marks' => [
                        'rules' => 'required|integer'
                    ]
                ];

                if (!$this->validate($validate)) {
                    return response()->setJSON([
                        'newToken' => csrf_hash(),
                        'errors' => $this->validator->getErrors()
                    ]);
                } else {

                    $student = new Student();
                    $student->where('id', $this->request->getPost('id'))
                        ->set([
                            'name' => $this->request->getPost('name'),
                            'subject' => $this->request->getPost('subject'),
                            'mark' => $this->request->getPost('marks')
                        ])
                        ->update();
---
UPDATE `students` SET `name` = 'Jithin', `subject` = 'maths', `mark` = '89'
WHERE `id` = '69'

            if ($this->request->getPost('action') == 'delete') {

                $student = new Student();
                $student->where('id', $this->request->getPost('id'))->delete();
---
DELETE FROM `students`
WHERE `id` = '69'