app/Controllers/TeacherController.php

SELECT *
FROM `teachers`
WHERE `username` = 'teacher_1'
 LIMIT 1
---
    public function loginHandler()
    {
        if ($this->request->isAJAX()) {

            $validate = [
                'username' => [
                    'rules' => 'required|max_length[100]|min_length[3]'
                ],
                'password' => [
                    'rules' => 'required|max_length[100]|min_length[8]'
                ]
            ];

            if (!$this->validate($validate)) {
                return response()->setJSON([
                    'token' => csrf_hash(),
                    'errors' => $this->validator->getErrors()
                ]);
            } else {

                $teacher = new Teacher();
                $exist = $teacher->asObject()->where('username', $this->request->getPost('username'))->first();